laravelServer/server/app/Http/Controllers/Controller.php

select * from "status"
insert into "status" ("type", "on", "updated_at", "created_at") values ('2', 1, '2021-01-12 17:47:41', '2021-01-12 17:47:41') returning "id"
---
    public function changeOption(){
        $statuses = Status::all();
        request()->validate([
            'type' => 'required',
        ]);
        $status = new Status(request(['type']));
        if(request('status') === "on"){
            $status->on = 1;
        } else {
            $status->on =0;
        }
        $currentStatus = $statuses->where('type', $status->type);
        if($currentStatus){
            foreach ($currentStatus as $stat)
            $stat->delete();
        }
        $status->save();

select * from "status"
---
    public function index(){
        $statuses = Status::all();